#!/usr/local/bin/python3
# -*- encoding: utf-8 -*-
"""
@Author : wangshuo
@Contact : wangshuo41@baidu.com
@File : lyrics_to_medoly_prompt.py
@Time : 2023/12/22 3:52 PM
@Desc :
"""
chordal_prompt = """
请你根据你的知识，返回歌曲使用到的和弦。
返回```json```格式：```json{{"chordal": list}}```

歌曲名：{}
返回：
"""

songs_prompt = """
你是一个作词家，请你根据给定的"{theme}"主题，以"{emotion}"的情感色彩创作一首1句-2句左右中文歌,要求歌词结尾辅音相同，韵律一致，返回歌名song_name和歌词lyrics。
返回```json```格式：```json{{"lyrics": "", "song_name":""}}```

【主题】：欢乐过新年
【情感色彩】：欢快愉悦
返回：```json{{"lyrics": "新年到，笑声飘，欢乐气氛洋溢每个角落。鞭炮响，喜气扬，祝福和喜悦在新年里绽放。", "song_name":"新年欢笑乐陶陶"}}```

【主题】：夏天的思念
【情感色彩】：浪漫温馨
返回：```json{{"lyrics": "宁静的夏天，天空中繁星点点。心里头有写思念，思念你的脸。", "song_name":"宁夏"}}```

【主题】：{theme}
【情感色彩】：{emotion}
返回：
"""

melody_prompt_v1 = """
你是一个作曲家，请你根据你的做曲相关知识和方法，使用4/4拍，着重优化下述【旋律】和【节奏时值】，使得【旋律】和【节奏时值】能够匹配且流畅。
返回```json```格式：```json{{"notes": [], "durations":[]}}```
注意：
1.节奏时值是音符的持续时长
2.旋律和节奏时值之间是1:1匹配关系，即一个旋律对应一个节奏时值
3.请你使用【节奏时值】中出现过的时值，替换【节奏时值】中你认为不适合的时值，确保【节奏时值】与音符对应起来流畅且优美
4.使用4/4拍，即对应音符的第1拍和第3拍的【节奏时值】较长
5.请一定要确保优化后【旋律】和【节奏时值】的长度与原来的长度一致，否则会报错

【旋律】：['D4', 'D4', 'G4', 'D4', 'D4', 'E4', 'E4', 'rest']
【节奏时值】：['0.47619047619047616', '0.47619047619047616', '0.23809523809523808', '0.47619047619047616', 
            '0.47619047619047616', '0.23809523809523808', '0.23809523809523808', '0.9523809523809523']
返回：```json{{"notes":['D4', 'D4', 'G4', 'D4', 'D4', 'E4', 'E4', 'rest'],
        "durations":['0.5', '0.5', '0.25', '0.5', '0.5', '0.25', '0.25', '1.0']}}```
                    
【旋律】：{notes}
【节奏时值】：{durations}
返回：
"""

melody_prompt = """
你是一个作曲家，请你根据你的作曲相关知识和方法，使用4/4拍，根据"{emotion}"情感色彩着重优化下述【旋律】和【节奏时值】。
返回```json```格式：```json{{"notes": [], "durations":[]}}```

约束条件：
1.节奏时值是旋律中音符音符的持续时长, 旋律中音符和节奏时值之间是1:1匹配关系，即一个旋律对应一个节奏时值
2.你的节奏感很强，请你找出【节奏时值】中你认为不适合的时值，并使用【可选时值】中的值替换，确保【节奏时值】与音符对应起来流畅且优美。
3.使用4/4拍，即对应音符的第1拍和第3拍的【节奏时值】较长
4.请一定要确保优化后【旋律】和【节奏时值】的长度与原来的长度一致，内容与原来不同，否则会报错!你也会受到惩罚！！

【可选时值】: [0.68, 0.34, 0.17, 0.05]
【歌词】：宁静的夏天SP天空中繁星点点SP
【旋律】：['E4', 'G3', 'A3', 'D4', 'A4', 'rest', 'E4', 'E4', 'E4', 'E4', 'D4', 'C4', 'C4', 'rest']
【节奏时值】：['0.68', '0.68', '0.34', '0.34', '0.68', '0.05', '0.68', '0.68', '0.34', '0.34', '0.34', '0.68', '0.68', 
            '0.05']
返回：```json{{"notes":['E4', 'G3', 'A3', 'C4', 'C4', 'rest', 'E4', 'E4', 'E4', 'E4', 'D4', 'C4', 'C4', 'rest'],
        "durations":['0.68', '0.68', '0.34', '0.34', '0.68', '0.05', '0.34', '0.34', '0.34', '0.34', '0.34', '0.34', '0.68', '0.05']}}```

【可选时值】：{values}    
【歌词】：{lyrics}           
【旋律】：{notes}
【节奏时值】：{durations}
返回：
"""

