#!/usr/local/bin/python3
# -*- encoding: utf-8 -*-
"""
@Author : wangshuo
@Contact : wangshuo41@baidu.com
@File : songs_templete.py
@Time : 2023/11/30 4:45 PM
@Desc :
"""

ONOMATOPOEIC_WORDS = ["啊", "呀", "哎", "哟", "啦"]

# 人声的音调
Singer_F_dict = {
    "🔥星辉女音-女歌手👩‍🎤": 0,
    "🔥摇滚先锋-男歌手👨‍🎤": -10,
    '🔥魅声少年-男歌手👨‍🎤': -8, 
    "🔥温柔情歌-女歌手👩‍🎤":  0,
    "🔥宇宙少女-女歌手👩‍🎤": 0,
    "🔥银幕音魂-男歌手👨‍🎤": -4
}


# 歌曲人声的增加分贝
Songs_V_dict = {
    "稻香": 5,
    "宁夏": 5,
    "生日快乐歌": 5,
    "恭喜发财": 10,
    "新年喜洋洋": 5,
    "恭喜恭喜": 5,
    "好运来": 5,
    "粉红色的回忆": 5,
    "新年好": 5,
    "难忘今宵": 5,
    "甜蜜蜜": 5,
    "最炫民族风": 5,
    "听我说谢谢你": 5,
    "新年快乐歌": 5
}

# 歌曲伴奏合成开始的时间
Songs_ST_dict = {
    "稻香": 0,
    "宁夏": 0,
    "生日快乐歌": 0,
    "恭喜发财": 14500,
    "新年喜洋洋": 0,
    "恭喜恭喜": 0,
    "好运来": 0,
    "粉红色的回忆": 13400,
    "新年好": 0,
    "难忘今宵": 0,
    "甜蜜蜜": 0,
    "最炫民族风": 0,
    "听我说谢谢你": 14400,
    "新年快乐歌": 0
}

# 歌曲名映射
Songs_CN_dict = {
    "稻香": "DAOXIANG",
    "宁夏": "NINGXIA",
    "生日快乐歌": "HAPPYBIRTHDAY",
    "恭喜发财": "GONGXIFACAI",
    "新年喜洋洋": "XINGNIANXIYANGYANG",
    "恭喜恭喜": "GONGXIGONGXI",
    "好运来": "HAOYUNLAI",
    "粉红色的回忆": "FENHONGDEHUIYI",
    "新年好": "XINNIANHAO",
    "难忘今宵": "NANWANGJINXIAO",
    "甜蜜蜜": "TIANMIMI",
    "最炫民族风": "ZUIXUANMINGZUFENG",
    "听我说谢谢你": "TINGWOSHUOXIEXIENI",
    "新年快乐歌": "XINNIANKUAILEGE"
}

# 歌词
lyrics_dict = {
    "DAOXIANG": "\n对这个世界如果你有太多的抱怨\n跌倒了就不敢继续往前走\n为什么人要这么的脆弱堕落\n请你打开电视看看\n多少人为生命在努力勇敢的走下去我们是不是该知足\n珍惜一切就算没有拥有耶\n"
                "还记得你说家是唯一的城堡\n随着稻香河流继续奔跑\n微微笑小时候的梦我知道\n不要哭让萤火虫带着你逃跑\n乡间的歌谣永远的依靠\n回家吧回到最初的美好\n",
    "NINGXIA": "\n宁静的夏天\n天空中繁星点点\n心里头有些思念\n思念着你的脸\n我可以假装看不见\n也可以偷偷地想念\n直到让我摸到你那温暖的脸\n",
    "HAPPYBIRTHDAY": "\n对所有的烦恼说拜拜\n对所有的快乐说嗨嗨\n亲爱的亲爱的生日快乐\n每一天都精彩\n看幸福的花儿为你盛开\n听美妙的音乐为你喝彩\n亲爱的亲爱的生日快乐\n祝你幸福永远\n幸福永远\n",
    "GONGXIFACAI": "\n我恭喜你发财\n我恭喜你精彩\n最好的请过来\n不好的请走开\n哦礼多人不怪\n我祝满天下的女孩嫁一个好男孩俩小口永远在一块\n我祝满天下的小孩聪明胜过秀才智商充满你脑袋\n"
                   "我祝尊敬的姑奶奶三十六圈的比赛气不喘面容不改\n我祝三叔公的买卖生意扬名四海财运亨通住豪宅\n大摇\n大摆\n乐天替你消灾\n",
    "XINGNIANXIYANGYANG": "\n喜洋洋那个新年到啊\n大人小孩都起得早\n穿新衣那个带新帽呀\n人人的脸上都带着笑\n耍龙灯那个放鞭炮啊\n咚咚锵锵乒乒乓乓\n贴上一张红红的对联\n万事如意吉星高高照\n",
    "GONGXIGONGXI": "\n每条大街小巷\n每个人的嘴里\n见面第一句话\n就是恭喜恭喜\n恭喜恭喜恭喜你呀\n恭喜恭喜恭喜你\n冬天已到尽头\n真是好的消息\n温暖的春风\n就要吹醒大地\n恭喜恭喜恭喜你呀\n"
                    "恭喜恭喜恭喜你\n浩浩冰雪融解\n眼看梅花吐蕊\n漫漫长夜过去\n听到一声鸡啼\n恭喜恭喜恭喜你呀\n恭喜恭喜恭喜你\n经过多少困难\n历经多少磨练\n多少心儿盼望\n盼望春的消息\n"
                    "恭喜恭喜恭喜你呀\n恭喜恭喜恭喜你\n",
    "HAOYUNLAI": "\n叠个千纸鹤再系个红飘带\n愿善良的人们天天好运来\n你勤劳生活美你健康春常在\n你一生的忙碌为了笑逐颜开\n打个中国结请春风剪个彩\n愿祖国的日月年年好运来\n你凤舞太平年你龙腾新时代\n"
                 "你幸福的家园迎来百花盛开\n好运来祝你好运来\n好运带来了喜和爱\n好运来我们好运来\n迎着好运兴旺发达通四海\n",
    "FENHONGDEHUIYI": "\n夏天夏天悄悄过去留下小秘密\n压心底压心底不能告诉你\n晚风吹过温暖我心底我又想起你\n多甜蜜多甜蜜怎能忘记\n不能忘记你\n把你写在日记里\n不能忘记你心里想的还是你\n"
                      "浪漫的夏季\n还有浪漫的一个你\n给我一个粉红的回忆\n欧\n夏天夏天悄悄过去依然怀念你\n你一言你一语都叫我回忆\n就在就在秋天的梦里我又遇见你\n总是不能忘记你\n",
    "XINNIANHAO": "\n新年好呀新年好呀\n祝福大家新年好\n我们唱歌我们跳舞\n祝福大家新年好\n",
    "NANWANGJINXIAO": "\n难忘今宵\n难忘今宵\n不论天涯\n与海角\n神州万里同怀抱\n共祝愿祖国好\n祖国好\n共祝愿\n祖国好\n共祝愿\n祖国好\n告别今宵\n告别今宵\n无论新友\n与故交\n"
                      "明年春来再相邀\n青山在人未老\n人未老\n青山在\n人未老\n青山在\n人未老\n",
    "TIANMIMI": "\n甜蜜蜜你笑得甜蜜蜜\n好像花儿开在春风里\n开在春风里\n在哪里在哪里见过你\n你的笑容这样熟悉\n我一时想不起\n啊在梦里\n梦里梦里见过你\n甜蜜笑得多甜蜜\n是你\n是你\n梦见的就是你\n",
    "ZUIXUANMINGZUFENG": "\n苍茫的天涯是我的爱\n绵绵的青山脚下花正开\n什么样的节奏是最呀最摇摆\n什么样的歌声才是最开怀\n弯弯的河水从天上来\n流向那万紫千红一片海\n火辣辣的歌谣是我们的期待\n"
                         "一路边走边唱才是最自在\n我们要唱就要唱得最痛快\n你是我天边最美的云彩\n让我用心把你留下来\n悠悠的唱着最炫的民族风\n让爱卷走所有的尘埃\n你是我心中最美的云彩\n"
                         "斟满美酒让你留下来\n永远都唱着最炫的民族风\n是整片天空最美的姿态\n",
    "TINGWOSHUOXIEXIENI": "\n送给你小心心送你花一朵\n你在我生命中太多的感动\n你是我的天使一路指引我\n无论岁月变幻爱你唱成歌\n听我说谢谢你因为有你温暖了四季\n"
                          "谢谢你感谢有你世界更美丽我要谢谢你因为有你爱常在心底\n谢谢你感谢有你把幸福传递\n",
    "XINNIANKUAILEGE": "\n新年快乐恭喜你发财\n新年快乐笑口要常开\n身体健康多锻炼工作要顺心乐无边\n新年快乐每天都精彩\n新年快乐好运常常在\n美好的愿望都实现幸福的生活永相伴\n"
                       "新年到到新年美好的祝福说不完愿你的爱情比金坚\n美丽无黑线\n新年到到新年兄弟们让我们肩并肩美好的前景已浮现\n努力奔向前\n"
    }

# 音符
notes_dict = {
    "DAOXIANG": "C4 | C4 | A3 | C4 | A3 | C4 | C4 | C4 | D4 | D4 | D4 | D4 | E4 | C4 | rest | C4 | A3 | C4 | C4 | C4 "
                "| D4 | D4 | D4 | D4 | E4 | C4 | rest | C4 | A3 | C4 | C4 | C4 | D4 | D4 | D4 | D4 | C4 | E4 | E4 | "
                "rest | C4 | C4 | C4 | A3 | C4 | C4 | C4 | A3 | rest | C4 | A3 | C4 | C4 | C4 | D4 | D4 | D4 | D4 | "
                "E4 | C4 | C4 | C4 | A3 | C4 | C4 | C4 | D4 | D4 | D4 | D4 | E4 | C4 | rest | C4 | F4 | E4 | D4 | D4 "
                "| C4 | D4 | C4 | D4 | C4 | A3 | rest | E4 | G4 | G4 | G4 | G4 | G4 | G4 | G4 | G4 | G4 | E4 | D4 | "
                "rest | C4 | E4 | E4 | E4 | E4 | E4 | E4 | E4 | E4 | C4 | rest | A3 | C4 | C4 | C4 | C4 | D4 | D4 | "
                "D4 | C4 | E4 | E4 | rest | E4 | G4 | G4 | G4 | G4 | G4 | G4 | G4 | G4 | G4 | E4 | D4 | rest | C4 | "
                "E4 | E4 | E4 | E4 | E4 | E4 | E4 | E4 | C4 | rest | A3 | C4 | C4 | C4 | C4 | D4 | D4 | D4 | C4 | C4",
    "NINGXIA": "E4 | G3 | A3 | C4 | C4 | rest | E4 | E4 | E4 | E4 | D4 | C4 | C4 | rest | G3 | G3 | E3 | G3 | A3 | C4 "
               "| C4 | rest | A3 | A3 | C4 | A3 | G3 | G4 | rest | E4 | E4 | D4 | C4 | D4 | E4 | A3/G3 | G3 | rest | "
               "G3 | G3 | G3 | A3 | C4 | C4 | A3 | D4 | rest | G3 | A3 | C4 | D4 | E4 | G4 | G4 | A4 | E4 | D4 | "
               "D4/A3 | C4",
    "HAPPYBIRTHDAY": "B3 | G4 | E4 | F4 | G4 | E4 | F4 | B3 | B3 | rest | G3 | E4 | C4 | D4 | E4 | C4 | D4 | B4 | B4 "
                     "| rest | A4 | A4 | G4 | F4 | G4 | A4 | G4 | F4 | E4 | C4 | rest | E4 | E4 | C4 | E4 | F4 G4 | "
                     "F4 | rest | B3 | G4 | E4 | F4 | G4 | E4 | E4 | F4 | B3 | B3 | rest | G3 | E4 | C4 | D4 | E4 | "
                     "C4 | C4 | D4 | B4 C5 | B4 | rest | A4 | A4 | G4 | F4 | G4 | A4 | G4 | F4 | E4 | C4 | rest | E4 "
                     "| E4 | C4 | E4 | F4 G4 | F4 | rest | D4 | E4 | F4 | E4",
    "GONGXIFACAI": "E4 | A4 | G4 | A4 | G4 | E4 | rest | E4 | A4 | G4 | A4 | G4 | A4 | rest | E4 | D4 | E4 | D4 | C4 "
                   "| A3 | rest | E4 | D4 | E4 | D4 | C4 | D4 | rest | C4 | C4 | D4 | E4 | G4 | A4 | rest | E3 | A3 | "
                   "A3 | G3 | A3 | E3 | E3 | G3 | A3 C4 | A3 | G3 | A3 E3 | E3 | G3 | C4 | C4 | C4 | D4 | D4 | C4 | "
                   "D4 | E4 | rest | A3 | D4 | D4 | C4 | D4 | A3 | A3 | C4 | D4 E4 | D4 C4 | D4 | A3 | A3 | C4 | E4 | "
                   "E4 | D4 | C4 | E4 | G3 | A3 | rest | E3 | A3 | A3 | G3 | A3 | E3 | E3 | G3 | A3 | C4 | A3 | G3 | "
                   "A3 | E3 | G3 | C4 | C4 | C4 | D4 | D4 | D4 | E4 | rest | A3 | D4 | D4 | C4 | D4 | A3 | A3 | C4 | "
                   "D4 E4 | D4 C4 | D4 | A3 | A3 | C4 | E4 | E4 | D4 | C4 | E4 | G3 | A3 | rest | G3 | C4 | rest | C4 "
                   "D4 | E4 | rest | E4 G4 | G4 | E4 | D4 | C4 | D4",
    "XINGNIANXIYANGYANG": "G4 | G4 A4 | G4 | E4 | D4 | G4 | G4 A4 | G4 | E4 D4 | rest | G4 A4 | G4 D4 | G4 A4 | G4 | "
                          "D4 | E4 | D4 | C4 D4 E4 | rest | G4 | G4 A4 | G4 | E4 | D4 | G4 | G4 A4 | G4 | E4 D4 | "
                          "rest | G4 A4 | G4 | D4 | G4 A4 | G4 | D4 | C4 | G3 | C4 | rest | E4 | E4 G4 | D4 | D4 | D4 "
                          "| E4 D4 | E4 G4 | D4 | G4 | rest | F4 | G4 | F4 | E4 | D4 | E4 | D4 | C4 | rest | B3 | B3 "
                          "C4 | B3 | B3 C4 | B3 | B3 | C4 | B3 | B3 | rest | D4 | G4 | F4 G4 | F4 E4 | D4 E4 | G4 A4 "
                          "| E4 D4 | C4 G3 | C4",
    "GONGXIGONGXI": "C4 | D4 | E4 | F4 | A4 G4 | G4 | rest | G4 | C5 | C5 | G4 | G4 F4 | F4 | rest | G4 | A4 | G4 | "
                    "F4 | F4 E4 | E4 | rest | E4 | D4 | C4 | B3 | C4 | C4 | rest | F4 | G4 | E4 | G4 | D4 | G4 | C4 | "
                    "G4 | rest | F4 | G4 | E4 | G4 | D4 | G4 | C4 | rest | C4 | D4 | E4 | F4 | A4 G4 | G4 | rest | G4 "
                    "| C5 | C5 | G4 | G4 F4 | F4 | rest | G4 A4 | G4 | F4 | F4 E4 | E4 | rest | E4 | D4 | C4 | B3 | "
                    "C4 | C4 | rest | F4 | G4 | E4 | G4 | D4 | G4 | C4 | G4 | rest | F4 | G4 | E4 | G4 | D4 | G4 | C4 "
                    "| rest | C4 | D4 | E4 | F4 | A4 G4 | G4 | rest | G4 | C5 | C5 | G4 | G4 F4 | F4 | rest | G4 | A4 "
                    "| G4 | F4 | F4 E4 | E4 | rest | E4 | D4 | C4 | B3 | C4 | C4 | rest | F4 | G4 | E4 | G4 | D4 | G4 "
                    "| C4 | G4 | rest | F4 | G4 | E4 | G4 | D4 | G4 | C4 | rest | C4 | D4 | E4 | F4 | A4 G4 | G4 | "
                    "rest | G4 | C5 | C5 | G4 | G4 F4 | F4 | rest | G4 | A4 | G4 | F4 | F4 E4 | E4 | rest | E4 | D4 | "
                    "C4 | B3 | C4 | C4 | rest | F4 | G4 | E4 | G4 | D4 | G4 | C4 | G4 | rest | F4 | G4 | E4 | G4 | D4 "
                    "| G4 | C4",
    "HAOYUNLAI": "G4 | G4 | B4 | B4 | G4 | G4 | F4 | D4 | F4 | B4 | G4 | rest | G4 | B4 | B4 | B4 | B4 | F4 | G4 | F4 "
                 "| C4 | F4 | D4 | rest | C4 | D4 | C4 | B3 | D4 | C4 | D4 | G4 | F4 | D4 | G4 | G4 F4 | rest | G4 | "
                 "B4 | B4 | G4 | C5 | C5 | C5 | B4 | G4 | F4 | B4 | G4 | rest | G4 | G4 | B4 | B4 | G4 | G4 | F4 | D4 "
                 "| F4 | B4 | G4 | rest | G4 | B4 | B4 | B4 | B4 | F4 | G4 | F4 | C4 | F4 | D4 | rest | C4 | D4 | C4 "
                 "| B3 | D4 | C4 | D4 | G4 | F4 | D4 | G4 | G4 F4 | rest | G4 | B4 | B4 | G4 | C5 | C5 | C5 | B4 | G4 "
                 "| F4 | B4 | G4 | rest | G4 | D5 C5 | C5 | B4 | G4 | F4 | B4 | G4 | rest | G4 | C5 | B4 | G4 | F4 | "
                 "C4 | F4 G4 | F4 D4 | rest | D4 | G4 F4 | G4 | G4 | F4 | G4 | C5 B4 | C5 | rest | B4 | B4 | B4 | C5 "
                 "| D5 | D5 | C5 | B4 | F4 | B4 G4 | G4",
    "FENHONGDEHUIYI": "Gb4 | Gb4 | Gb4 | Gb4 | Gb4 | Ab4 Gb4 | Eb4 | Db4 | Cb4 | Db4 Cb4 | Ab3 | Cb4 | Cb4 Gb3 | rest "
                      "| Cb4 | Ab3 | Gb3 | Cb4 | Ab3 | Gb3 | Cb4 | Db4 | Eb4 Db4 | Cb4 | Db4 | rest | Gb4 | Gb4 | Gb4 "
                      "| Gb4 | Gb4 | Ab4 | Gb4 | Eb4 | Gb4 | Ab4 | Ab4 Cb5 | Ab4 | Gb4 | Gb4 Ab4 | rest | Db4 | Db4 "
                      "Cb4 | Ab3 | Db4 | Db4 Cb4 | Ab3 | Gb3 | Ab3 | Cb4 Db4 | Db4 Cb4 | rest | Gb4 | Gb4 | Gb4 | Ab4 "
                      "| Gb4 | rest | Cb5 | Ab4 | Gb4 | Gb4 | Gb4 | Ab4 | Gb4 | rest | Gb4 | Gb4 | Gb4 | Ab4 | Cb5 | "
                      "Ab4 | Gb4 | Eb4 | Gb4 | Db4 | Eb4 | Gb4 | rest | Db4 | Db4 | Db4 | Eb4 | Eb4 Db4 | rest | Db4| "
                      "Cb4 | Db4 | Db4 | Cb4 | Ab3 | Cb4 | Ab3 Gb3 | rest | Cb4 | Db4 | Eb4 | Gb4 | Ab4 | Ab4 Cb5 | "
                      "Ab4 | Gb4 | Gb4 | rest | Gb4 | rest | Gb4 | Gb4 | Gb4 | Gb4 | Gb4 | Ab4 Gb4 | Eb4 | Db4 | Cb4 "
                      "| Db4 Cb4 | Ab3 | Cb4 | Cb4 Gb3 | rest | Cb4 | Ab3 | Gb3 | Cb4 | Ab3 | Gb3 | Cb4 | Db4 | Eb4 "
                      "Db4 | Cb4 | Db4 | rest | Gb4 | Gb4 | Gb4 | Gb4 | Gb4 | Ab4 | Gb4 | Eb4 | Gb4 | Ab4 | Ab4 Cb5 | "
                      "Ab4 | Gb4 | Gb4 Ab4 | rest | Gb4 | Cb5 Ab4 | Eb4 | Gb4 | Eb4 | Db4 | Db4 Cb4",
    "XINNIANHAO": "Eb4 | Eb4 | Eb4 | Bb3 | Gb4 | Gb4 | Gb4 | Eb4 | rest | Eb4 | Gb4 | Bb4 | Bb4 | Ab4 | Gb4 | Fb4 | "
                   "rest | Fb4 | Gb4 | Ab4 | Ab4 | Gb4 | Fb4 | Gb4 | Eb4 | rest | Eb4 | Gb4 | Fb4 | Bb3 | Db4 | Fb4 |"
                   " Eb4",
    "NANWANGJINXIAO": "A4 B4 A4 | G4 | A4 B4 A4 | D4 | rest | D4 | D5 | D5 A4 C5 B4 | A4 | rest | F5 G4 A4 B4 | G4 | "
                      "F4 G4 A4 B4 | D4 | rest | D4 C5 | B4 C5 B4 A4 | G4 | rest | D5 E5 D5 | C5 G4 | B4 C5 D5 E5 | "
                      "D5 | A4 E5 | D5 E5 C5 E5 | D5 | rest | B4 C5 | B4 A4 | D4 | B4 C5 | B4 A4 | G4 | rest | D4 C5 "
                      "| B4 C5 B4 A4 | G4 | rest | E5 D5 | C5 G4 | C5 E5 D5 | rest | E5 D5 | C5 G4 | C5 E5 D5 | rest | "
                      "B4 A4 | G4 D4 | G4 B4 A4 | rest | B4 A4 | G4 D4 | G4 B4 D4 | rest | A4 B4 A4 | G4 | A4 B4 A4 | "
                      "D4 | rest | D4 | D5 | D5 A4 C5 B4 | A4 | rest | F5 G4 A4 B4 | G4 | F4 G4 A4 B4 | D4 | rest | "
                      "D4 C5 | B4 C5 B4 A4 | G4 | rest | D5 E5 D5 | C5 G4 | B4 C5 D5 E5 | D5 | A4 E5 | D5 E5 C5 E5 | "
                      "D5 | rest | B4 C5 | B4 A4 | D4 | B4 C5 | B4 A4 | G4 | rest | D4 C5 | B4 C5 B4 A4 | G4 | rest | "
                      "E5 D5 | C5 G4 | C5 E5 D5 | rest | E5 D5 | C5 G4 | C5 E5 D5 | rest | B4 A4 | G4 D4 | G4 B4 A4 | "
                      "rest | B4 A4 | G4 D4 | G4 B4 D4",
    "TIANMIMI": "D#4 E#4 | G#4 A#4 | E#4 | C#4 | C#4 D#4 | C#4 | D#4 | E#4 G#4 | G#4 E#4 | rest | C#4 D#4 | D#4 | "
                "D#4 | D#4 E#4 | D#4 C#4 | C#4 | A#3 G#3 | G#3 | A#3 C#4 | rest | D#4 | D#4 E#4 D#4 | E#4 D#4 | E#4 "
                "G#4 | G#4 D#4 | rest | D#4 E#4 | G#4 A#4 | E#4 | C#4 | C#4 D#4 | C#4 | D#4 | E#4 G#4 | G#4 E#4 | "
                "rest | D#4 | D#4 | D#4 | D#4 E#4 | D#4 C#4 | C#4 | A#3 G#3 | A#3 C#4 | rest | E#4 | D#4 C#4 | C#4 | "
                "A#3 G#3 | G#3 | A#3 C#4 | rest | D#4 E#4 | G#3 | A#3 C#4 G#3 A#3 | A#3 C#4 | rest | A#3 B#3 | A#3 "
                "B#3 | A#3 | A#3 C#4 | A#3 G#3 | G#3 | D#4 E#4 | rest | A#3 B#3 | A#3 B#3 | A#3 | A#3 C#4 | A#3 G#3 | "
                "G#3 | D#4 E#4 | rest | G#4 A#4 | G#4 | rest | G#4 A#4 | G#4 | rest | G#4 A#4 | G#4 | G#4 A#4 | G#4 | "
                "G#4 A#4 | G#4",
    "ZUIXUANMINGZUFENG": "Bb3 | Bb3 | Ab3 | Bb3 | Ab3 | Db4 | Db4 | Eb4 Db4 | Bb3 | rest | Db4 | Db4 | Ab3 | Db4 | "
                         "Eb4 | Fb4 | Ab4 | Ab4 Fb4 | Eb4 | Fb4 | rest | Bb4 | Bb4 | Bb4 | Ab4 | Fb4 | Fb4 | Db4 | "
                         "Bb3 | Bb3 | Bb3 | Fb4 | Eb4 Fb4 Fb4 | rest | Fb4 | Fb4 | Ab4 | Fb4 | Eb4 | Fb4 | Eb4 | Db4 "
                         "| Bb3 | Ab3 | Bb3 | rest | Bb3 | Bb3 | Ab3 | Bb3 | Ab3 | Db4 | Db4 | Eb4 Db4 | Bb3 | rest | "
                         "Db4 | Db4 | Ab3 | Db4 | Eb4 | Fb4 | Ab4 | Ab4 Fb4 | Eb4 | Fb4 | rest | Bb4 | Bb4 | Bb4 | "
                         "Ab4 | Fb4 | Fb4 | Db4 | Bb3 | Bb3 | Bb3 | Fb4 | Eb4 Fb4 Fb4 | rest | Fb4 | Fb4 | Ab4 | Fb4 "
                         "| Eb4 | Fb4 | Eb4 | Db4 | Bb3 | Ab3 | Bb3 | rest | Fb4 | Fb4 | Ab4 | Fb4 | Fb4 | Ab4 | Ab4 "
                         "| Bb4 | Db5 Bb4 | Ab4 | Bb4 Db5 Bb4 | rest | Bb3 | Bb3 | Ab3 | Bb3 | Db4 | Eb4 | Fb4 Eb4 | "
                         "Db4 | Eb4 | Fb4 | rest | Bb3 | Bb4 | Bb4 | Ab4 | Eb4 | Fb4 Eb4 | Db4 | Eb4 | Fb4 | rest | "
                         "Db4 Bb3 | Bb3 | Db4 | Eb4 | Ab3 | Ab3 | Eb4 | Ab4 | Fb4 | Eb4 | Db4 | rest | Bb3 | Db4 | "
                         "Eb4 | Fb4 | Eb4 | Db4 | Ab3 | Fb3 | Bb3 | rest | Bb3 | Bb3 | Ab3 | Bb3 | Db4 | Eb4 | Fb4 "
                         "Eb4 | Db4 | Eb4 | Fb4 | rest | Bb3 | Bb4 | Bb4 | Ab4 | Eb4 | Fb4 Eb4 | Db4 | Eb4 | Fb4 | "
                         "rest | Db4 Bb3 | Bb3 | Db4 | Eb4 | Ab3 | Ab3 | Eb4 | Ab4 | Fb4 | Eb4 | Db4 | rest | Db4 | "
                         "Bb3 | Db4 | Eb4 | Fb4 | Ab4 | Fb4 | Fb4 | Ab4 | Bb4",
    "TINGWOSHUOXIEXIENI": "Gb3 | Ab3 | Eb4 | Db4 | Cb4 | Db4 | Ab3 | Cb4 | Cb4 | Ab3 | Gb3 | rest | Ab3 | Cb4 | Db4 | "
                          "Eb4 | Gb4 | Gb4 | Ab4 | Gb4 | Eb4 | Cb4 | Db4 | rest | Eb4 | Gb4 | Eb4 | Gb4 | Gb4 Ab4 | "
                          "Gb4 | Eb4 | Db4 | Db4 | Cb4 | Ab3 | rest | Gb3 | Ab3 | Cb4 | Eb4 | Db4 | Db4 | Eb4 | Db4 | "
                          "Cb4 | Ab3 | Cb4 | rest | Cb4 | Db4 | Eb4 | Gb4 | Eb4 | Eb4 | Db4 | Db4 | Cb4 | Db4 | Cb4 | "
                          "Ab3 | Cb4 | Db4 | Eb4 | rest | Cb4 | Ab3 | Cb4 | Gb3 | Gb3 | Db4 | Cb4 | Eb4 | Db4 | Db4 | "
                          "Cb4 | Db4 | Cb4 | Db4 | Gb4 | Eb4 | Eb4 | Db4 | Db4 | Cb4 | Db4 | Cb4 | Ab3 | Cb4 | Gb4 | "
                          "Eb4 | rest | Cb4 | Ab3 | Cb4 | Gb3 | Gb3 | Db4 | Cb4 | Eb4 | Db4 | Cb4 | Ab3 | Cb4",
    "XINNIANKUAILEGE": "A4 | A4 G4 | E4 | G4 | A4 | B4 | A4 | G4 | A4 | rest | A4 | A4 G4 | E4 | G4 | A4 | B4 | A4 | "
                       "G4 | E4 | rest | D4 | D4 E4 | G4 | A4 | G4 E4 | D4 C4 | D4 E4 | D4 | D4 | E4 | G4 | D5 | B4 "
                       "A4 | G4 B4 | A4 | rest | A4 | A4 G4 | E4 | G4 | A4 | B4 | A4 | G4 | A4 | rest | A4 | A4 G4 | "
                       "E4 | G4 | A4 | B4 | A4 | G4 | E4 | rest | D4 | D4 | E4 | G4 | A4 | G4 E4 | D4 C4 | D4 E4 | D4 "
                       "| D4 | E4 | G4 | D5 | B4 A4 | G4 B4 | A4 | rest | A4 | A4 G5 | A4 C5 | E4 G4 | A4 C5 | G4 | "
                       "G4 | G4 | C5 | A4 C5 | A4 G4 | G4 E4 | E4 C4 | D4 | D4 | D4 | E4 | G4 | C5 | A4 G4 | A4 G4 | "
                       "A4 | rest | G5 | E5 | D5 | C5 A4 | C5 | rest | A4 | A4 G5 | A4 C5 | E4 G4 | A4 C5 | G4 | G4 | "
                       "G4 | C5 | A4 C5 | A4 | G4 | G4 E4 | E4 C4 | D4 | D4 | D4 | E4 | G4 | C5 | A4 G4 | A4 G4 | A4 "
                       "| rest | G5 | E5 | D5 | C5 A4 | C5"
}

# 音符时长
notes_duration_dict = {
    "DAOXIANG": "0.1625 | 0.1625 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.1625 | 0.1625 | 0.1625 | 0.1625 | 0.1625 | "
                "0.1625 | 0.325 | 0.325 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.1625 | 0.1625 | 0.1625 | 0.1625 | "
                "0.1625 | 0.1625 | 0.325 | 0.325 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.1625 | 0.1625 | 0.1625 | "
                "0.1625 | 0.1625 | 0.1625 | 0.325 | 0.325 | 0.65 | 0.4875 | 0.325 | 0.1625 | 0.1625 | 0.1625 | 0.1625 "
                "| 0.1625 | 0.1625 | 0.1625 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.1625 | 0.1625 | 0.1625 | 0.1625 | "
                "0.1625 | 0.1625 | 0.325 | 0.1625 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.1625 | 0.1625 | 0.1625 | "
                "0.1625 | 0.1625 | 0.1625 | 0.325 | 0.325 | 0.4875 | 0.1625 | 0.4875 | 0.325 | 0.1625 | 0.1625 | "
                "0.1625 | 0.1625 | 0.1625 | 0.65 | 0.975 | 0.1625 | 0.65 | 0.325 | 0.325 | 0.325 | 0.1625 | 0.325 | "
                "0.325 | 0.325 | 0.1625 | 0.1625 | 0.1625 | 0.325 | 0.325 | 0.1625 | 0.325 | 0.1625 | 0.325 | 0.325 | "
                "0.325 | 0.1625 | 0.1625 | 0.1625 | 0.325 | 0.325 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.1625 | "
                "0.1625 | 0.325 | 0.1625 | 0.1625 | 0.325 | 0.325 | 1.3 | 0.65 | 0.325 | 0.325 | 0.325 | 0.1625 | "
                "0.325 | 0.325 | 0.325 | 0.1625 | 0.1625 | 0.1625 | 0.325 | 0.325 | 0.1625 | 0.325 | 0.1625 | 0.325 | "
                "0.1625 | 0.325 | 0.1625 | 0.1625 | 0.1625 | 0.325 | 0.325 | 0.1625 | 0.325 | 0.1625 | 0.4875 | "
                "0.1625 | 0.1625 | 0.325 | 0.1625 | 0.4875 | 0.325 | 1.3",
    "NINGXIA": "0.68 | 0.68 | 0.34 | 0.34 | 0.68 | 0.05 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.68 | 0.05 | "
               "0.17 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.68 | 0.05 | 0.17 | 0.34 | 0.17 | 0.34 | 0.34 | 0.68 | "
               "0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.68 | 0.34 | 0.17 | 0.17 | 0.17 | 0.34 | "
               "0.34 | 0.34 | 0.34 | 0.68 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 0.34 | 1.2 "
               "| 0.68 | 1.8",
    "HAPPYBIRTHDAY": "0.25 | 0.5 | 0.25 | 0.125 | 0.5 | 0.5 | 0.5 | 0.5 | 0.5 | 0.25 | 0.25 | 0.5 | 0.25 | 0.125 | "
                     "0.5 | 0.5 | 0.5 | 0.5 | 0.5 | 0.5 | 0.5 | 0.25 | 0.125 | 0.5 | 0.25 | 0.125 | 0.5 | 0.5 | 0.5 | "
                     "0.5 | 0.125 | 0.5 | 0.25 | 0.125 | 0.5 | 0.25 0.25 | 1 | 0.375 | 0.25 | 0.5 | 0.25 | 0.125 | "
                     "0.5 | 0.25 | 0.25 | 0.5 | 0.5 | 0.5 | 0.125 | 0.25 | 0.5 | 0.25 | 0.125 | 0.5 | 0.25 | 0.25 | "
                     "0.5 | 0.25 0.25 | 0.5 | 0.125 | 0.5 | 0.25 | 0.125 | 0.5 | 0.25 | 0.125 | 0.5 | 0.5 | 0.5 | 0.5 "
                     "| 0.125 | 0.5 | 0.25 | 0.25 | 0.5 | 0.25 0.25 | 0.75 | 0.125 | 0.25 | 0.5 | 0.5 | 2",
    "GONGXIFACAI": "0.227 | 0.455 | 0.455 | 0.455 | 0.227 | 1.592 | 0.455 | 0.227 | 0.455 | 0.455 | 0.455 | 0.227 | "
                   "1.592 | 0.227 | 0.277 | 0.341 | 0.114 | 0.227 | 0.227 | 0.455 | 0.227 | 0.227 | 0.341 | 0.114 | "
                   "0.227 | 0.227 | 0.455 | 0.341 | 0.227 | 0.455 | 0.455 | 0.455 | 0.455 | 1.82 | 2.65 | 0.227 | "
                   "0.455 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.341 0.114 | 0.227 | 0.227 | 0.227 0.227 "
                   "| 0.227 | 0.341 | 0.455 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.91 | 0.75 | 0.227 | "
                   "0.455 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.341 | 0.227 0.227 | 0.227 0.227 | 0.227 | 0.227 "
                   "| 0.227 | 0.341 | 0.227 | 0.227 | 0.227 | 0.227 | 0.455 | 0.455 | 0.91 | 0.682 | 0.277 | 0.455 | "
                   "0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.341 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | "
                   "0.341 | 0.455 | 0.227 | 0.227 | 0.371 | 0.371 | 0.227 | 1 | 0.582 | 0.227 | 0.455 | 0.227 | 0.227 "
                   "| 0.227 | 0.227 | 0.227 | 0.227 | 0.227 0.227 | 0.227 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | "
                   "0.227 | 0.227 | 0.227 | 0.227 | 0.455 | 0.455 | 0.91 | 0.55 | 0.455 | 0.91 | 0.455 | 0.227 0.227 "
                   "| 0.91 | 0.455 | 0.227 0.227 | 0.682 | 0.227 | 0.455 | 0.455 | 1.2",
    "XINGNIANXIYANGYANG": "0.455 | 0.227 0.227 | 0.455 | 0.227 | 0.227 | 0.455 | 0.227 0.227 | 0.455 | 0.227 0.227 | "
                          "0.114 | 0.227 0.227 | 0.227 0.227 | 0.227 0.227 | 0.227 | 0.227 | 0.91 | 0.227 | 0.227 "
                          "0.227 0.455 | 0.114 | 0.455 | 0.227 0.227 | 0.455 | 0.227 | 0.227 | 0.455 | 0.227 0.227 | "
                          "0.455 | 0.227 0.227 | 0.114 | 0.227 0.227 | 0.227 | 0.227 | 0.227 0.227 | 0.227 | 0.227 | "
                          "0.682 | 0.227 | 0.455 | 0.114 | 0.455 | 0.227 0.227 | 0.455 | 0.227 | 0.227 | 0.227 0.227 "
                          "| 0.227 0.227 | 0.682 | 0.227 | 0.114 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | "
                          "0.227 | 0.227 | 0.114 | 0.455 | 0.227 0.227 | 0.455 | 0.227 0.227 | 0.227 | 0.455 | 0.227 "
                          "| 0.455 | 0.455 | 0.114 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 0.227 0.227 | 0.227 "
                          "0.227 | 0.227 0.227 | 0.227 0.227 | 0.227",
    "GONGXIGONGXI": "0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | "
                    "0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | "
                    "0.224 | 0.224 | 0.224 | 0.224 | 0.447 | 0.447 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | "
                    "0.112 | 0.224 | 0.112 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | "
                    "0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | "
                    "0.224 0.224 | 0.447 | 0.112 | 0.224 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | 0.224 "
                    "| 0.224 | 0.224 | 0.224 | 0.447 | 0.447 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 "
                    "| 0.224 | 0.112 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | "
                    "0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | "
                    "0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | "
                    "0.224 | 0.224 | 0.224 | 0.224 | 0.447 | 0.447 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | "
                    "0.112 | 0.224 | 0.112 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | "
                    "0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | "
                    "0.224 0.224 | 0.447 | 0.112 | 0.224 | 0.224 | 0.224 | 0.224 | 0.224 0.224 | 0.447 | 0.112 | "
                    "0.224 | 0.224 | 0.224 | 0.224 | 0.447 | 0.447 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | "
                    "0.112 | 0.224 | 0.112 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224 | 0.112 | 0.224",
    "HAOYUNLAI": "0.341 | 0.114 | 0.227 | 0.227 | 0.682 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.91 | 0.114 | "
                 "0.227 | 0.227 | 0.341 | 0.114 | 0.455 | 0.455 | 0.227 | 0.227 | 0.227 | 0.227 | 0.682 | 0.114 | "
                 "0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.682 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 0.682 "
                 "| 0.114 | 0.227 | 0.227 | 0.341 | 0.114 | 0.227 | 0.227 | 0.227 | 0.227 | 0.455 | 0.227 | 0.227 | "
                 "1.82 | 2.114 | 0.341 | 0.114 | 0.227 | 0.227 | 0.682 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.91 "
                 "| 0.114 | 0.227 | 0.227 | 0.341 | 0.114 | 0.455 | 0.455 | 0.227 | 0.227 | 0.227 | 0.227 | 0.682 | "
                 "0.114 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | 0.682 | 0.227 | 0.227 | 0.227 | 0.227 | 0.227 | "
                 "0.227 0.682 | 0.114 | 0.227 | 0.227 | 0.341 | 0.114 | 0.227 | 0.227 | 0.227 | 0.227 | 0.455 | 0.227 "
                 "| 0.227 | 1.82 | 0.114 | 0.455 | 0.341 0.114 | 0.455 | 0.227 | 0.227 | 0.455 | 0.455 | 0.91 | 0.114 "
                 "| 0.455 | 0.455 | 0.455 | 0.227 | 0.227 | 0.455 | 0.227 0.227 | 0.227 0.682 | 0.114 | 0.455 | 0.341 "
                 "0.114 | 0.455 | 0.227 | 0.227 | 0.455 | 0.341 0.114 | 0.91 | 0.114 | 0.341 | 0.114 | 0.227 | 0.227 "
                 "| 0.227 | 0.227 | 0.227 | 0.227 | 0.455 | 0.682 0.114 | 2.73",
    "FENHONGDEHUIYI": "0.273 | 0.273 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | "
                      "0.273 | 0.273 | 0.273 0.818 | 0.136 | 0.545 | 0.273 | 0.273 | 0.545 | 0.273 | 0.273 | 0.273 | "
                      "0.273 | 0.136 0.136 | 0.273 | 1.09 | 0.236 | 0.273 | 0.273 | 0.273 | 0.273 | 0.273 | 0.136 | "
                      "0.136 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | 0.273 | 0.273 | 0.136 1.09 | 0.136 | 0.545 | "
                      "0.136 0.136 | 0.273 | 0.545 | 0.136 0.136 | 0.273 | 0.273 | 0.273 | 0.273 0.273 | 0.136 1.09 | "
                      "0.136 | 0.409 | 0.136 | 0.273 | 0.273 | 0.409 | 0.229 | 0.283 | 0.283 | 0.419 | 0.146 | 0.283 "
                      "| 0.273 | 0.373 | 0.809 | 0.409 | 0.136 | 0.273 | 0.273 | 0.545 | 0.273 | 0.273 | 0.273 | "
                      "0.136 0.136 | 0.273 | 0.273 | 0.818 | 0.273 | 0.409 | 0.136 | 0.273 | 0.273 | 0.136 0.273 | "
                      "0.273 | 0.273 | 0.273 | 0.136 | 0.273 | 0.136 | 0.273 | 0.273 | 0.273 0.818 | 0.136 | 0.409 | "
                      "0.136 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | 0.273 | 0.273 | 1.635 | 0.273 | 0.545 | 0.136 | "
                      "0.273 | 0.273 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | "
                      "0.273 | 0.273 | 0.273 0.818 | 0.136 | 0.545 | 0.273 | 0.273 | 0.545 | 0.273 | 0.273 | 0.273 | "
                      "0.273 | 0.136 0.136 | 0.273 | 1.09 | 0.136 | 0.273 | 0.273 | 0.273 | 0.273 | 0.273 | 0.136 | "
                      "0.136 | 0.273 | 0.273 | 0.273 | 0.136 0.136 | 0.273 | 0.273 | 0.136 1.09 | 0.273 | 0.545 | "
                      "0.136 0.273 | 0.136 | 0.409 | 0.273 | 0.273 | 0.273 1.363",
    "XINNIANHAO": '0.25 | 0.25 | 0.5 | 0.5 | 0.25 | 0.25 | 0.5 | 0.5 | 0.125 | 0.25 | 0.25 | 0.5 | 0.5 | 0.25 | 0.25 '
                   '| 1 | 0.25 | 0.25 | 0.25 | 0.5 | 0.5 | 0.25 | 0.25 | 0.5 | 0.5 | 0.125 | 0.25 | 0.25 | 0.5 | 0.5 '
                   '| 0.25 | 0.25 | 0.75',
    "NANWANGJINXIAO": "0.536 0.268 0.268 | 1.07 | 0.536 0.268 0.268 | 1.07 | 0.268 | 0.536 | 0.536 | 0.268 0.268 "
                      "0.268 0.268 | 2.143 | 0.268 | 0.268 0.134 0.268 0.268 | 1.07 | 0.268 0.268 0.268 0.268 | 1.07 "
                      "| 0.268 | 0.536 0.536 | 0.268 0.268 0.268 0.268 | 2.143 | 0.268 | 0.536 0.268 0.268 | 0.536 "
                      "0.536 | 0.268 0.268 0.268 0.268 | 1.07 | 0.536 0.536 | 0.268 0.268 0.268 0.268 | 2.143 | 0.268 "
                      "| 0.268 0.268 | 0.268 0.268 | 1.07 | 0.268 0.268 | 0.268 0.268 | 1.07 | 0.268 | 0.536 0.536 | "
                      "0.268 0.268 0.268 0.268 | 2.143 | 0.268 | 0.268 0.268 | 0.268 0.268 | 0.268 0.268 2.678 | "
                      "0.268 | 0.268 0.268 | 0.268 0.268 | 0.268 0.268 2.678 | 0.268 | 0.268 0.268 | 0.268 0.268 | "
                      "0.268 0.268 2.678 | 0.268 | 0.268 0.268 | 0.268 0.268 | 0.268 0.268 2.678 | 0.268 | 0.536 "
                      "0.268 0.268 | 1.07 | 0.536 0.268 0.268 | 1.07 | 0.268 | 0.536 | 0.536 | 0.268 0.268 0.268 "
                      "0.268 | 2.143 | 0.268 | 0.268 0.134 0.268 0.268 | 1.07 | 0.268 0.268 0.268 0.268 | 1.07 | "
                      "0.268 | 0.536 0.536 | 0.536 0.536 0.536 0.536 | 2.143 | 0.268 | 0.536 0.268 0.268 | 0.536 "
                      "0.536 | 0.268 0.268 0.268 0.268 | 1.07 | 0.536 0.536 | 0.268 0.268 0.268 0.268 | 2.143 | 0.268 "
                      "| 0.268 0.268 | 0.268 0.268 | 1.07 | 0.268 0.268 | 0.268 0.268 | 1.07 | 0.268 | 0.536 0.536 | "
                      "0.268 0.268 0.268 0.268 | 2.143 | 0.268 | 0.268 0.268 | 0.268 0.268 | 0.268 0.268 2.678 | "
                      "0.268 | 0.268 0.268 | 0.268 0.268 | 0.268 0.268 2.678 | 0.268 | 0.268 0.268 | 0.268 0.268 | "
                      "0.268 0.268 2.678 | 0.268 | 0.268 0.268 | 0.268 0.268 | 0.268 0.268 2.678",
    "TIANMIMI": "0.2083 0.8333 | 0.4167 0.4167 | 1.25 | 0.4167 | 0.2083 0.625 | 0.2083 | 0.4167 | 0.2083 0.2083 | "
                "0.2083 1.6667 | 0.2083 | 0.2083 0.4167 | 0.4167 | 0.4167 | 0.2083 0.2083 | 0.2083 0.2083 | 0.4167 | "
                "0.2083 0.2083 | 0.4167 | 0.2083 1.25 | 0.2083 | 0.4167 | 0.2083 0.625 0.2083 | 0.2083 0.2083 | "
                "0.2083 0.2083 | 0.2083 1.3333 | 1.6667 | 0.2083 0.8333 | 0.4167 0.4167 | 1.25 | 0.4167 | 0.2083 "
                "0.625 | 0.2083 | 0.4167 | 0.2083 0.2083 | 0.2083 1.6667 | 0.2083 | 0.4167 | 0.4167 | 0.4167 | 0.2083 "
                "0.2083 | 0.2083 0.2083 | 0.4167 | 0.2083 0.625 | 0.2083 1.25 | 0.2083 | 0.4167 | 0.2083 0.2083 | "
                "0.4167 | 0.2083 0.2083 | 0.4167 | 0.2083 1.3333 | 0.2083 | 0.2083 1.6667 | 0.4167 | 0.2083 0.2083 "
                "0.2083 0.2083 | 0.2083 1.3333 | 0.2083 | 0.4167 0.4167 | 0.4167 0.4167 | 0.4167 | 0.2083 0.2083 | "
                "0.2083 0.2083 | 0.4167 | 0.2083 1.3333 | 0.2083 | 0.4167 0.4167 | 0.4167 0.4167 | 0.4167 | 0.2083 "
                "0.2083 | 0.2083 0.2083 | 0.4167 | 0.2083 2.5 | 0.4167 | 0.2083 0.2083 | 0.8333 | 0.4167 | 0.2083 "
                "0.2083 | 0.8333 | 0.4167 | 0.2083 0.2083 | 0.4167 | 0.2083 0.2083 | 0.4167 | 0.2083 0.2083 | 1.6667",
    "ZUIXUANMINGZUFENG": "0.4688 | 0.2344 | 0.2344 | 0.4688 | 0.2344 | 0.2344 | 0.4688 | 0.2344 0.2344 | 0.9375 | "
                         "0.1172 | 0.4688 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 0.2344 | "
                         "0.4688 | 0.9375 | 0.1172 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.4688 | 0.2344 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.0586 0.0586 0.9375 | 0.1172 | 0.2344 | 0.2344 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.4688 | 0.4688 | 0.9375 | 0.1172 | "
                         "0.4688 | 0.2344 | 0.2344 | 0.4688 | 0.2344 | 0.2344 | 0.4688 | 0.2344 0.2344 | 0.9375 | "
                         "0.1172 | 0.4688 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 0.2344 | "
                         "0.4688 | 0.9375 | 0.1172 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.4688 | 0.2344 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.0586 0.0586 0.9375 | 0.1172 | 0.2344 | 0.2344 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.4688 | 0.4688 | 0.9375 | 0.1172 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 0.2344 | "
                         "0.4688 | 0.0586 0.0586 0.9375 | 0.1172 | 0.4688 | 0.2344 | 0.2344 | 0.4688 | 0.4688 | "
                         "0.2344 | 0.1172 0.1172 | 0.2344 | 0.2344 | 0.9375 | 0.1172 | 0.2344 | 0.2344 | 0.2344 | "
                         "0.2344 | 0.1172 | 0.1172 0.1172 | 0.2344 | 0.2344 | 0.9375 | 0.1172 | 0.2344 0.2344 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.4688 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.9375 | "
                         "0.1172 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.9375 | "
                         "0.1172 | 0.4688 | 0.2344 | 0.2344 | 0.4688 | 0.4688 | 0.2344 | 0.1172 0.1172 | 0.2344 | "
                         "0.2344 | 0.9375 | 0.1172 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.1172 | 0.1172 0.1172 | "
                         "0.2344 | 0.2344 | 0.9375 | 0.1172 | 0.2344 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.4688 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.7031 | 0.1172 | 0.2344 | 0.2344 | 0.2344 | "
                         "0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.2344 | 0.9375",
    "TINGWOSHUOXIEXIENI": "0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.75 "
                          "| 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.5 "
                          "| 0.75 | 0.375 | 0.375 | 0.375 | 0.1875 0.1875 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | "
                          "0.75 | 0.75 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 "
                          "| 1.2 | 0.375 | 0.375 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.1875 | 0.1875 | 0.375 | "
                          "0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | 0.75 | 0.1875 | "
                          "0.1875 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | "
                          "0.375 | 0.75 | 0.1875 | 0.1875 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | 0.375 | 0.75 | "
                          "0.375 | 0.375 | 0.375 | 0.75 | 0.1875 | 0.1875 | 0.375 | 0.75 | 0.375 | 0.375 | 0.375 | "
                          "0.375 | 1.5",
    "XINNIANKUAILEGE": "0.455 | 0.227 0.227 | 0.455 | 0.455 | 0.2279999999999999997 | 0.113 | 0.227 | 0.227 | 0.455 | "
                       "0.455 | 0.455 | 0.227 0.227 | 0.455 | 0.455 | 0.2279999999999999997 | 0.113 | 0.227 | 0.227 | "
                       "0.455 | 0.455 | 0.455 | 0.227 0.227 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 0.227 0.68 "
                       "| 0.455 | 0.227 | 0.227 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 1 | 0.7999999999999998 "
                       "| 0.455 | 0.227 0.227 | 0.455 | 0.455 | 0.2279999999999999997 | 0.113 | 0.227 | 0.227 | 0.455 "
                       "| 0.455 | 0.455 | 0.227 0.227 | 0.455 | 0.455 | 0.2279999999999999997 | 0.113 | 0.227 | 0.227 "
                       "| 0.455 | 0.455 | 0.455 | 0.227 | 0.227 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 0.227 "
                       "0.68 | 0.227 | 0.455 | 0.227 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 1 | "
                       "0.7999999999999998 | 0.455 | 0.227 0.227 | 0.68 0.227 | 0.227 0.227 | 0.227 0.227 | 1.365 | "
                       "0.227 | 0.455 | 0.227 | 0.227 0.227 | 0.227 0.227 | 0.227 0.227 | 0.227 0.227 | 1.365 | 0.227 "
                       "| 0.455 | 0.227 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 0.455 | 0.455 | 0.455 | 0.455 | "
                       "0.455 | 0.227 0.227 | 1.365 | 1.365 | 0.455 | 0.227 0.227 | 0.68 0.227 | 0.227 0.227 | 0.227 "
                       "0.227 | 1.365 | 0.227 | 0.455 | 0.227 | 0.227 0.227 | 0.227 | 0.227 | 0.227 0.227 | 0.227 "
                       "0.227 | 1.365 | 0.227 | 0.455 | 0.227 | 0.455 | 0.455 | 0.227 0.227 | 0.227 0.227 | 0.455 | "
                       "0.455 | 0.455 | 0.455 | 0.455 | 0.227 0.227 | 1.365"

}

# 槽位
lyrics_slot_dict = {
    "DAOXIANG": "\n[对这个世界][如果][你有太多的抱怨]\n[跌倒了]就[不敢][继续往前走]\n[为什么][人要这么的脆弱堕落]\n[请你][打开电视][看看]\n[多少人][为生命在努力][勇敢的走下去]["
                "我们是不是该知足]\n[珍惜一切][就算没有拥有耶]\n[还记得][你说家是唯一的城堡]\n[随着稻香河流][继续奔跑]\n[微微笑][小时候的梦][我知道]\n[不要哭][让萤火虫带着你逃跑]\n["
                "乡间的歌谣][永远的依靠]\n[回家吧][回到最初的美好]\n",
    "NINGXIA": "\n[宁静的][夏天]\n[天空中][繁星点点]\n[心里头][有些][思念]\n[思念着][你的][脸]\n[我可以][假装][看不见]\n[也可以][偷偷地][想念]\n[直到][让我][摸到]["
               "你那][温暖的][脸]\n",
    "HAPPYBIRTHDAY": "\n[对所有的][烦恼][说拜拜]\n[对所有的][快乐][说嗨嗨]\n[亲爱的][亲爱的][生日快乐]\n[每一天][都精彩]\n[看幸福的][花儿][为你][盛开]\n[听美妙的]["
                     "音乐][为你喝彩]\n[亲爱的][亲爱的][生日快乐]\n[祝你][幸福][永远]\n[幸福][永远]\n ",
    "GONGXIFACAI": "\n[我恭喜][你发财]\n[我恭喜][你精彩]\n[最好的][请过来]\n[不好的][请走开]\n[哦礼多人不怪]\n[我祝满天下的女孩][嫁一个好男孩][俩小口永远在一块]\n["
                   "我祝满天下的小孩][聪明胜过秀才][智商充满你脑袋]\n[我祝尊敬的姑奶奶][三十六圈的比赛][气不喘面容不改]\n[我祝三叔公的买卖][生意扬名四海][财运亨通住豪宅]\n[大摇]\n["
                   "大摆]\n[乐天替你消灾]\n[恭喜发财]\n[要喊得够豪迈]\n[恭喜发财]\n[我恭喜][你发财]\n[我恭喜][你精彩]\n[最好的][请过来]\n[不好的][请走开]\n[哦礼多人不怪]",
    "XINGNIANXIYANGYANG": '\n[喜洋洋][那个新年到啊]\n[大人小孩][都起得早]\n[穿新衣][那个][带新帽呀]\n[人人的脸上][都带着笑]\n[耍龙灯][那个][放鞭炮啊]\n[咚咚锵锵]['
                          '乒乒乓乓]\n[贴上一张][红红的][对联]\n[万事如意][吉星高高照]\n',
    "GONGXIGONGXI": '\n[每条][大街小巷]\n[每个人][的嘴里]\n[见面][第一句话]\n[就是][恭喜恭喜]\n[恭喜][恭喜][恭喜][你呀]\n[恭喜][恭喜][恭喜][你]\n[冬天]['
                    '已到尽头]\n[真是][好的消息]\n[温暖][的春风]\n[就要][吹醒大地]\n[恭喜][恭喜][恭喜][你呀]\n[恭喜][恭喜][恭喜你]\n[浩浩冰雪][融解]\n[眼看]['
                    '梅花吐蕊]\n[漫漫长夜][过去]\n[听到][一声鸡啼]\n[恭喜][恭喜][恭喜][你呀]\n[恭喜][恭喜][恭喜][你]\n[经过][多少][困难]\n[历经][多少][磨练]\n['
                    '多少][心儿盼望]\n[盼望][春的消息]\n[恭喜][恭喜][恭喜][你呀]\n[恭喜][恭喜][恭喜][你]\n',
    "HAOYUNLAI": '\n[叠个][千纸鹤][再系个][红飘带]\n[愿][善良的人们][天天好运来]\n[你][勤劳生活美][你][健康春常在]\n[你][一生的忙碌][为了笑逐颜开]\n[打个][中国结][请春风]['
                 '剪个彩]\n[愿][祖国的][日月][年年好运来]\n[你][凤舞太平年][你][龙腾新时代]\n[你][幸福的家园][迎来百花盛开]\n[好运来][祝你][好运来]\n[好运][带来了]['
                 '喜和爱]\n[好运来][我们好运来]\n[迎着好运][兴旺发达][通四海]\n',
    "FENHONGDEHUIYI": '\n[夏天夏天悄悄过去留下小秘密]\n[压心底压心底不能告诉你]\n[晚风吹过温暖我心底我又想起你]\n[多甜蜜多甜蜜怎能忘记]\n[不能忘记你]\n[把你写在日记里]\n['
                      '不能忘记你心里想的还是你]\n[浪漫的夏季]\n[还有浪漫的一个你]\n[给我一个粉红的回忆]\n[欧]\n[夏天夏天悄悄过去依然怀念你]\n[你一言你一语都叫我回忆]\n['
                      '就在就在秋天的梦里我又遇见你]\n[总是不能忘记你]\n',
    "XINNIANHAO": '\n[新年好呀][新年好呀]\n[祝福大家][新年好]\n[我们唱歌][我们跳舞]\n[祝福大家][新年好]\n',
    "NANWANGJINXIAO": '\n[难忘今宵]\n[难忘今宵]\n[不论天涯]\n[与海角]\n[神州万里][同怀抱]\n[共祝愿][祖国好]\n[祖国好]\n[共祝愿]\n[祖国好]\n[共祝愿]\n[祖国好]\n['
                      '告别今宵]\n[告别今宵]\n[无论新友]\n[与故交]\n[明年春来][再相邀]\n[青山在][人未老]\n[人未老]\n[青山在]\n[人未老]\n[青山在]\n[人未老]\n',
    "TIANMIMI": '\n[甜蜜蜜][你笑得][甜蜜蜜]\n[好像花儿][开在春风里]\n[开在春风里]\n[在哪里][在哪里][见过你]\n[你的笑容][这样熟悉]\n[我一时][想不起]\n[啊在梦里]\n[梦里]['
                '梦里][见过你]\n[甜蜜][笑得多甜蜜]\n[是你]\n[是你]\n[梦见的][就是你]\n',
    "ZUIXUANMINGZUFENG": '\n[苍茫的天涯][是我的爱]\n[绵绵的][青山脚下][花正开]\n[什么样的][节奏][是最呀最摇摆]\n[什么样的][歌声][才是最开怀]\n[弯弯的][河水]['
                         '从天上来]\n[流向][那万紫千红][一片海]\n[火辣辣的][歌谣][是我们的期待]\n[一路][边走边唱][才是最自在]\n[我们][要唱就要唱得][最痛快]\n[你是]['
                         '我天边][最美的云彩]\n[让我][用心][把你留下来]\n[悠悠的][唱着][最炫的民族风]\n[让爱卷走][所有的尘埃]\n[你是][我心中][最美的云彩]\n[斟满美酒]['
                         '让你留下来]\n[永远都][唱着][最炫的民族风]\n[是整片天空][最美的姿态]\n',
    "TINGWOSHUOXIEXIENI": '\n[送给你][小心心][送你花一朵]\n[你在我生命中][太多的感动]\n[你是][我的天使][一路指引我]\n[无论岁月变幻][爱你唱成歌]\n[听我说][谢谢你]['
                          '因为有你][温暖了四季]\n[谢谢你][感谢有你][世界更美丽][我要谢谢你][因为有你][爱常在心底]\n[谢谢你][感谢有你][把幸福传递]\n',
    "XINNIANKUAILEGE": "\n[新年快乐][恭喜你][发财]\n[新年快乐][笑口][要常开]\n[身体健康][多锻炼][工作][要][顺心][乐无边]\n[新年快乐][每天][都精彩]\n[新年快乐]["
                       "好运][常常在]\n[美好的][愿望][都实现][幸福的][生活][永相伴]\n[新年到][到新年][美好的][祝福][说不完][愿你的][爱情][比金坚]\n[美丽][无黑线]\n["
                       "新年到][到新年][兄弟们][让我们][肩并肩][美好的][前景][已浮现]\n[努力][奔向前]\n"
}